
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.lau-frontend-session-storage.azurerm_private_endpoint.this[0]
* Update
  * azurerm_key_vault_secret.redis_access_key
* Replace
  * module.lau-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://lau-aat.vault.azure.net/secrets/frontend-redis-access-key/d9ddf68e73ab412083e239b026ab248e"
        name                    = "frontend-redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.lau-frontend-session-storage.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "lau-frontend-session-storage-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "lau-frontend-session-storage-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/lau-frontend.git"
          + "application"         = "log-and-audit"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#lau-dev"
          + "environment"         = "staging"
          + "managedBy"           = "LAU"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "lau-frontend-session-storage-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.lau-frontend-session-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ hostname                      = "lau-frontend-session-storage-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-frontend-session-storage-cache-aat/providers/Microsoft.Cache/Redis/lau-frontend-session-storage-aat" -> (known after apply)
        name                          = "lau-frontend-session-storage-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      ~ private_static_ip_address     = "10.96.133.84" -> (known after apply)
      ~ public_network_access_enabled = true -> false
      ~ redis_version                 = "4.0.14" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ ssl_port                      = 6380 -> (known after apply)
      - subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat" -> null # forces replacement
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/lau-frontend.git"
            "application"         = "log-and-audit"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "staging"
            "managedBy"           = "LAU"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (7 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          ~ maxfragmentationmemory_reserved = 300 -> 642
          ~ maxmemory_delta                 = 200 -> 642
          ~ maxmemory_reserved              = 200 -> 642
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":150,"Program":"tfcmt","SHA1":"","Vars":{}} -->